000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FUN-DEMO.

000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000700 01 RESULT PIC 9(1) VALUE 0.
000800 01 STR1 PIC X(16) VALUE 'Cobol is not fun'.
000900 01 STR2 PIC X(10) VALUE ' at all!'.
001000 01 STR3 PIC X(40).
001100 01 NUM1 PIC 9 VALUE 1.
001200 01 NUM2 PIC 9 VALUE 1.
001300 01 NUM3 PIC 9 VALUE 1.
001400 01 MY-FLOAT PIC 9(1)V9(2) VALUE 0.00.
       

001400 PROCEDURE DIVISION.
      *> cobol-lint CL002 begin
001500 BEGIN.
001600     PERFORM VARYING NUM1 FROM 1 BY 1 UNTIL NUM1 > 3
               DISPLAY "Perform varying loop with a float : " MY-FLOAT
001700         DISPLAY "Perform varying with an Int: " NUM1
               ADD 1.1 TO MY-FLOAT
001800     END-PERFORM.

001900     PERFORM UNTIL NUM2 >= 3
002000         ADD 1 TO NUM2
002100         DISPLAY "Perform until: " NUM2
002200     END-PERFORM.

001900     PERFORM 3 TIMES
002000         ADD 1 TO NUM2
002100         DISPLAY "Perform Times: " NUM2
002200     END-PERFORM.

002300     PERFORM MULTIPLY-PARAGRAPH 
           THRU MULTIPLY-PARAGRAPH-EXIT 3 TIMES

           MOVE 5 TO NUM1
           MOVE 6 TO NUM2

           PERFORM SUBSTRACT-PARAGRAPH
           DISPLAY "The Result of NUM1 - NUM2 is: " RESULT

002600     STRING 
002700         STR1 DELIMITED BY SIZE 
002800         STR2 DELIMITED BY SIZE 
002900         INTO STR3
003000     DISPLAY "String concatenation: " STR3
           DISPLAY "But I can change my mind if I get an A!"

003100     STOP RUN.

003200 MULTIPLY-PARAGRAPH.
003300     MULTIPLY NUM1 BY NUM2 GIVING RESULT
003600     DISPLAY "Result of the Multiply with a perform thru " RESULT
003700     .

003800 MULTIPLY-PARAGRAPH-EXIT.
003900     IF NUM3 > 3
004000         EXIT
004100     END-IF
004200     ADD 1 TO NUM3
004300     .

       SUBSTRACT-PARAGRAPH.
           SUBTRACT NUM1 FROM NUM2 GIVING RESULT    
           EXIT
           .
